# Project: DataFrame
**TODOS:**
* Read the data
* Convert the 'Year' column to datetime
* Carry out multiplication on 'Population' * 1000
* Find the mean of the population of each country
* Replace the country name with the shortform 

Hint: `use python string method`

In [1]:
import pandas as pd

In [33]:
# read the data
data = pd.read_csv('data/population.csv')
data.head()

   Country  Year  Population
0  Denmark  2000         5.3
1  Denmark  2010         5.5
2  Denmark  2020         5.8
3   Sweden  2000         8.8
4   Sweden  2010         9.3

In [34]:
data.dtypes

Country        object
Year            int64
Population    float64
dtype: object

In [35]:
# convert year to datetime
data['Year'] = pd.to_datetime(data['Year'],format='%Y')

In [36]:
data.head()

   Country       Year  Population
0  Denmark 2000-01-01         5.3
1  Denmark 2010-01-01         5.5
2  Denmark 2020-01-01         5.8
3   Sweden 2000-01-01         8.8
4   Sweden 2010-01-01         9.3

In [37]:
# scale population by multiplying 1000
data['Population'] = data['Population']*1000
data.head()

   Country       Year  Population
0  Denmark 2000-01-01      5300.0
1  Denmark 2010-01-01      5500.0
2  Denmark 2020-01-01      5800.0
3   Sweden 2000-01-01      8800.0
4   Sweden 2010-01-01      9300.0

In [38]:
# calculate the mean population of the country
data.groupby('Country').mean()

          Population
Country
Denmark  5533.333333
Sweden   9433.333333

In [39]:
# aliter
data.groupby('Country')['Population'].mean()

Country
Denmark    5533.333333
Sweden     9433.333333
Name: Population, dtype: float64

In [40]:
data.dtypes

Country               object
Year          datetime64[ns]
Population           float64
dtype: object

In [41]:
# replace Denmark to DNK
data['Country'] = data['Country'].str.replace("Denmark","DNK")

In [42]:
data.head()

  Country       Year  Population
0     DNK 2000-01-01      5300.0
1     DNK 2010-01-01      5500.0
2     DNK 2020-01-01      5800.0
3  Sweden 2000-01-01      8800.0
4  Sweden 2010-01-01      9300.0

In [43]:
data['Country'] = data['Country'].str.replace("Sweden","SWD")
data.head()

  Country       Year  Population
0     DNK 2000-01-01      5300.0
1     DNK 2010-01-01      5500.0
2     DNK 2020-01-01      5800.0
3     SWD 2000-01-01      8800.0
4     SWD 2010-01-01      9300.0